import perebor_ml as gh
import rost as bbb
import pandas as pd
kv2 = pd.DataFrame({'Чистые ошибки и пропуски(С)':gh.gh('Чистые ошибки и пропуски(С)'),
                    'Чистые ошибки и пропуски':gh.gh('Чистые ошибки и пропуски'),
                    'Ошибки и пропуски': gh.gh('Ошибки и пропуски'),
                    'Абс. чоп':gh.gh('Абс. чоп'),
                    'Индекс сред.':gh.gh('Индекс сред.'),
                    'Индекс мин':gh.gh('Индекс мин'),
                    'Индекс макс':gh.gh('Индекс макс'),
                    'Индекс медиана':gh.gh('Индекс медиана'),
                    'сред. vol':gh.gh('сред. vol'),
                    'vol мин':gh.gh('vol мин'),
                    'vol макс':gh.gh('vol макс'),
                    'vol медиана':gh.gh('vol медиана'),
                    'об макс-мин':gh.gh('vol макс')-gh.gh('vol мин'),
                    'об сред-мин':gh.gh('сред. vol')-gh.gh('vol мин'),
                    'об мед-мин':gh.gh('vol медиана')-gh.gh('vol мин'),
                    'об макс-сред':gh.gh('vol макс')-gh.gh('сред. vol'),
                    'об мед-сред':gh.gh('vol медиана')-gh.gh('сред. vol'),
                    'Прирост об макс/мед':gh.gh('vol макс')-gh.gh('vol медиана')/gh.gh('vol медиана'),
                    'Об мед+макс+сред+мед':gh.gh('vol медиана')+gh.gh('vol макс')
                         +gh.gh('vol мин')+gh.gh('сред. vol'),
                    'Инд макс-мин':gh.gh('Индекс макс')-gh.gh('Индекс мин'),
                    'Инд сред-мин':gh.gh('Индекс сред.')-gh.gh('Индекс мин'),
                    'Инд мед-мин':gh.gh('vol медиана')-gh.gh('Индекс мин'),
                    'Инд макс-сред':gh.gh('Индекс макс')-gh.gh('Индекс сред.'),
                    'Инд мед-сред':gh.gh('Индекс медиана')-gh.gh('Индекс сред.'),
                    'Прирост макс/мед':gh.gh('Индекс макс')-gh.gh('Индекс медиана')/gh.gh('Индекс медиана'),
                    'Инд мед+макс+сред+мед':gh.gh('Индекс медиана')+gh.gh('Индекс макс')
                         +gh.gh('Индекс мин')+gh.gh('Индекс сред.'),
                    'Инд макс*мин':gh.gh('Индекс макс')*gh.gh('Индекс мин'),
                    'volmin*indmax':gh.gh('vol мин')*gh.gh('Индекс макс'),
                    'volmax*indmax':gh.gh('vol макс')*gh.gh('Индекс макс'),
                    'чоп':gh.gh('Чистые ошибки и пропуски')/gh.gh('Абс. чоп'),
                    'чоп(с)':gh.gh('Чистые ошибки и пропуски(С)')/gh.gh('Ошибки и пропуски')
                    })


kv2.to_excel('D:\work\data1\Data_mlv_new_table.xlsx')